In [1]:
import pandas as pd

In [2]:
data = {'age': [22, 30, 25, 40],
        'name': ['John', 'Alice', 'Bob', 'Eve']}
df = pd.DataFrame(data)

In [5]:
column_headers=list(df.columns.values)
print('The Column Header : ',column_headers)

The Column Header :  ['age', 'name']

In [6]:
column_headers=df.columns.values.tolist()
print('The Column Header : ',column_headers)

The Column Header :  ['age', 'name']

In [8]:
df["C"]=[10,20,30,40]
df

   age   name   C
0   22   John  10
1   30  Alice  20
2   25    Bob  30
3   40    Eve  40

In [11]:
df.insert(1,"h",5)
df

   age  h  D   name   C
0   22  5  5   John  10
1   30  5  5  Alice  20
2   25  5  5    Bob  30
3   40  5  5    Eve  40

In [13]:
df.loc[:,'E']=list('abcd')
df

   age  h  D   name   C  E
0   22  5  5   John  10  a
1   30  5  5  Alice  20  b
2   25  5  5    Bob  30  c
3   40  5  5    Eve  40  d

In [14]:
df=df.assign(F=df.C*10)
df

   age  h  D   name   C  E    F
0   22  5  5   John  10  a  100
1   30  5  5  Alice  20  b  200
2   25  5  5    Bob  30  c  300
3   40  5  5    Eve  40  d  400